
&НаКлиенте
Процедура НайтиЗначение(Команда)
	
	//В книге грокаем алгоритмы сказано что бинарный поиск работает только для 
	//отсортированных массивов, сортировать пока не будем, создадим сразу упорядоченный.
	//При нажатии на кнопку найти значение создаем простой упорядоченный массив в цикле
	
	Массив = Новый Массив;
	Для Счетчик = 1 По Объект.КоличествоВМассиве Цикл
		Массив.Добавить(Счетчик);
	КонецЦикла;
	
	//Вызов функции бинарного поиска и сразу поместим в переменную результат
	Результат = БинарныйПоиск(Массив, Объект.ИскомоеЗначение);
	
	//Отправляем результат в процедуру вывода сообщения
	ВыводСообщения(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗначениеВМассивеНеЧетныхЧисел(Команда)
	
	//При нажатии на данную кнопку
	//создаем упорядоченный массив четных чисел в цикле
	
	Массив = Новый Массив;
	Для Счетчик = 1 По Объект.КоличествоВМассиве Цикл
		//Ветвление для отделения четных от нечетных чисел с помощью проверки на остаток от деления
		Если НЕ Счетчик % 2 = 0 Тогда
			Массив.Добавить(Счетчик);
		КонецЕсли;
	КонецЦикла;
	
	//Вызов функции бинарного поиска и сразу поместим в переменную результат
	Результат = БинарныйПоиск(Массив, Объект.ИскомоеЗначение);
	
	//Отправляем результат в процедуру вывода сообщения
	ВыводСообщения(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗначениеВМассивеЧетныхЧисел(Команда)
	
	//При нажатии на данную кнопку
	//создаем упорядоченный массив четных чисел в цикле
	Массив = Новый Массив;
	
	Для Счетчик = 1 По Объект.КоличествоВМассиве Цикл
		//Ветвление для отделения четных от нечетных чисел с помощью проверки на остаток от деления
		Если Счетчик % 2 = 0 Тогда
			Массив.Добавить(Счетчик);
		КонецЕсли;
	КонецЦикла;

	//Вызов функции бинарного поиска и сразу поместим в переменную результат
	Результат = БинарныйПоиск(Массив, Объект.ИскомоеЗначение);
	
	//Отправляем результат в процедуру вывода сообщения
	ВыводСообщения(Результат);
	
КонецПроцедуры


&НаКлиенте
Функция БинарныйПоиск(Массив, ИскомоеЧисло)
	
	//А вот функция ради которой разработана обработка
	//в книге на языке Python функция выглядит так
	//
	//def binary_search(list, item):
	//	low = 0  # В переменных low и high хранятся границы списка где присходит поиск
	//	high = len(list) - 1
	//	
	//	while low <= high:  # Пока область поиска не сократится до одного элемента...
	//		mid = (low + high) // 2  # Если значение (low+high) нечетно, то Python втоматически округлит
										//значение mid в меньшую сторону
	//		guess = list[mid]  # Получаем значение среднего элемента
	//		if guess == item:  # Значение найдено
	//			return mid
	//		elif guess > item:  # Если значение больше искомого
	//			high = mid - 1  # Обновляем верхнюю границу
	//		else:
	//			low = mid + 1  # Если значение меньше искомого
	//	return None  # Если элемент не найден
	
	//Пример использования
	//my_list = [1, 3, 5, 7, 9]
	//print(binary_search(my_list, 3))  # => 1 (индекс 1 соответствует значению 3)
	//print(binary_search(my_list, -1))  # => None
	
	//Итак напишем на языке 1С
	//В переменных Наименьшее и Наибольшее хранятся границы списка где присходит поиск
	Наименьшее = 0; 
	Наибольшее = Массив.Количество()-1;	
	
	//Пока область поиска не сократится до одного элемента...
	Пока Наименьшее <= Наибольшее Цикл
		
		//И тут первое отличие, нужно повторить mid = (low + high) // 2
		//в Python использование оператора "//" гарантирует, что mid будет целым числом,
		//что важно, так как индексы массива должны быть целыми.
		//В 1С будем работать с целыми числами с помощью функции "Цел()".
		// «Цел()» — это инструмент для получения целой части числа путём 
		//отсечения его дробной части. Она не округляет число, а просто удаляет всё, 
		//что находится после запятой.
		//Получаем значение среднего элемента
		Среднее = Цел((Наименьшее + Наибольшее) / 2);
		ПредположительноеЧисло = Массив[Среднее];
		
		//Значение найдено
		Если ПредположительноеЧисло = ИскомоеЧисло Тогда
			Возврат Среднее;
		//Если значение больше искомого обновляем верхнюю границу
		ИначеЕсли ПредположительноеЧисло > ИскомоеЧисло Тогда
			Наибольшее = Среднее - 1;
		//Если значение меньше искомого
		Иначе
			Наименьшее = Среднее + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	//В случае неудачи вернем строку
	Возврат "Искомое значение не найдено в массиве";
	
КонецФункции

&НаКлиенте
Процедура ВыводСообщения (Результат)
	
	Сообщение = Новый СообщениеПользователю;
	
	//В зависимости от типа значения переменной Результат выводим разные сообщения
	Если ТипЗнч(Результат) = Тип("Число") Тогда
		Сообщение.Текст = "Индекс значения в массиве " + Результат;
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
		Сообщение.Текст = Результат;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

