
&НаКлиенте
Процедура СортировкаМассиваКакВКниге(Команда)
	
	//Вызываем функцию создания массива
	Массив = СозатьМассив();
	//Вызываем функцию сортировки массива
	СортированныйМассив = СортировкаВыбором_КакВКниге(Массив);
	//Сообщим результат сортировки (в цыкле перечислим значения)
	СообщитьЗначенияМассива(СортированныйМассив);
	
КонецПроцедуры

&НаКлиенте
Функция  СозатьМассив()
	
	//Создаем массив в точности как в книге
	Массив = Новый Массив;
	Массив.Добавить(5);
	Массив.Добавить(3);
	Массив.Добавить(6);
	Массив.Добавить(2);
	Массив.Добавить(10);
	
	Возврат Массив
	
КонецФункции

&НаКлиенте
Функция НайтиНаименьшееЗначениеВМассиве (Массив)
	
	//В книге пример выглядит так
	//def find_smallest(list_to_sort):
	//
	//smallest = list_to_sort[0] #для хранения наименьшего значения
	//smallest_index = 0         #для хранения индекса наименьшего значения
	//
	//for i in range(1, len(list_to_sort)):
	//	if list_to_sort[i] < smallest:
	//		smallest_index = i
	//		smallest = list_to_sort[i]
	//		
	//		return smallest_index #обходим массив и возвращаем индекс наименьшего значения
	
	Наименьший = Массив[0];       //для хранения наименьшего значения
	НаименьшийИндекс = 0;         //для хранения индекса наименьшего значения
	
	Для Индекс = 1 По Массив.ВГраница() Цикл
		Если Массив[Индекс] < Наименьший Тогда
			Наименьший = Массив[Индекс];
			НаименьшийИндекс = Индекс; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат НаименьшийИндекс;     //обходим массив и возвращаем индекс наименьшего значения
	
КонецФункции

&НаКлиенте
Функция СортировкаВыбором_КакВКниге(Массив)
	
	//В книге пример выглядит так
	//def selection_sort(list_to_sort):
	//
	//new_list = [] #Создаем новый массив
	//
	//for i in range(len(list_to_sort)):
	//	
	//	smallest = find_smallest(list_to_sort) #Находим индекс наименьшего элемента в исходном массиве 
	//	
	//	new_list.append(list_to_sort.pop(smallest)) #Удаляем обработанный элемент из исходного массива и добавляем в новый массив
	//	
	//	return new_list
	
	//Создаем новый массив
	ОтсортированныйМассив = Новый Массив;
	
	Для Индекс = 0 По Массив.ВГраница() Цикл
		// Находим индекс наименьшего элемента в исходном массиве
		НаименьшийИндекс = НайтиНаименьшееЗначениеВМассиве(Массив);
		
		// Добавляем найденный наименьший элемент в новый массив
		ОтсортированныйМассив.Добавить(Массив[НаименьшийИндекс]);
		
		// Удаляем обработанный элемент из исходного массива
		Массив.Удалить(НаименьшийИндекс);
	КонецЦикла;
	
	Возврат ОтсортированныйМассив;
	
КонецФункции

&НаКлиенте
Процедура СортировкаВыборомАльтернативная(Команда)
	
	//Вызываем функцию создания массива
	Массив = СозатьМассив();
	//Вызываем функцию сортировки массива
	СортированныйМассив = СортировкаВыбором_АльтернативныйВариант(Массив);
	//Сообщим результат сортировки (в цыкле перечислим значения)
	СообщитьЗначенияМассива(СортированныйМассив);
	
КонецПроцедуры

&НаКлиенте
Функция СортировкаВыбором_АльтернативныйВариант (Массив)
	
	//В книге приведен хороший пример, но вариант без нового массива мне нравится больше
	Наименьшее = 0;
	// i это начало неотсортированной части массива
	// j это текущий минимум неотсортированной части массива
	Для i = 0 По Массив.ВГраница() Цикл
		Наименьшее = i;
		Для j = i + 1 По Массив.ВГраница() Цикл
			// Ищем минимальный элемент в массиве
			Если Массив[j] < Массив[Наименьшее] Тогда
				Наименьшее = j;
			КонецЕсли;
		КонецЦикла;
		Если Массив[Наименьшее] = Массив[i] Тогда
			// Если минимальный элемент массива равен первому элементу неотсортированной части, то пропускаем
			Продолжить;
		КонецЕсли;
		Смена = Массив[i]; // Производим замену элементов массива
		Массив[i] = Массив[Наименьшее];
		Массив[Наименьшее] = Смена;
	КонецЦикла;
	
	Возврат Массив
	
КонецФункции

&НаКлиенте
Процедура СоздатьМассив(Команда)
	
	//Это просто демонстрация изначально созданного массива
	Массив = СозатьМассив();
	СообщитьЗначенияМассива(Массив);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьЗначенияМассива(Массив)
	
	//Процедура конторая просто сообщает все значения элементов массива
	Для Каждого Элемент Из Массив Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Элемент;
		Сообщение.Сообщить();
	КонецЦикла; 
	
КонецПроцедуры







