
&НаКлиенте
Процедура ЗапуститьОбратныйОтсчет(Команда)
	
	i = Объект.НачальноеЗначениеОтсчета;
	
	ОбратныйОтсчёт(i);
	
КонецПроцедуры

&НаКлиенте
Функция ОбратныйОтсчёт(i)
	
	//Снова пример обратного отсчета из книги
	//def countdown(i):
	//
	//if i < 0:               #Базовый случай
	//	return
	//else:
	//	print(i)
	//	return countdown(i-1) #Рекурсивный случай
	
	//Повторяем на 1С
	
	Если i < 0 Тогда                 //Базовый случай
		Возврат Ложь
	Иначе
		СообщитьЗначение(i);
		ОбратныйОтсчёт(i - 1);       //Рекурсивный случай
	КонецЕсли;
	
	//Интересный момент Возврат в 1С не работает как return в Python
	//Чтобы прервать функцию с помощью Возврат нужно добавить какое либо значение возврата
	//Немного информации из книги
	//Комментарий Ли Колдуэлла с сайта Stack Owerlow: "Цыклы могут ускорить работу программы.
	//Рекурсия может ускорить работу программиста. Выбирайте что важнее в вашей ситуации."
	
КонецФункции

&НаКлиенте
Процедура СообщитьЗначение(i)
	
	//Процедура конторая просто сообщает значение
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = i;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	
	//Присваиваем значение поля формы в переменную x
	x = Объект.ВычислитьФакториал;
	//Помещаем в переменную результат вернувшееся значение функции факториал
	Результат = Факториал(x);
	//Сообщаем результат
	СообщитьЗначение(Результат);
	
КонецПроцедуры

Функция Факториал(x)
	
	//Пример вычисления Факториала из книги 
	//def fact(x):
	//
	//if x == 1:                        #Базовый случай
	//	return 1
	//else:
	//	return x * fact(x-1)            #Рекурсивный случай
	
	//Немного про отличия
	//Оператор == в Paython проверяет эквивалентность значений — содержат ли две переменные одинаковые данные.
	//Оператор = в 1C проверяет эквивалентность значений — содержат ли две переменные одинаковые данные.
	
	//Повторяем на 1С
	
	Если x = 1 Тогда                    //Базовый случай
		Возврат 1;
	Иначе
		Возврат x * Факториал(x - 1);   //Рекурсивный случай
	КонецЕсли;
	
КонецФункции








